20220329092624-metropolis_adjusted_langevin_algorithm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Metropolis-Adjusted Langevin Algorithm</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Metropolis-Adjusted Langevin Algorithm</h1>
<p>
The Metropolis-Adjusted Langevin algorithm updates the position of the chain \(\boldsymbol{\theta}_t\) at time \(t\) based of the overdamped Langevin diffusion equation:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #d73a49;">\begin</span>{<span style="color: #6f42c1;">equation</span>}
<span style="color: #d73a49;">\mathrm</span>{d} L_t = <span style="color: #d73a49;">\mathrm</span>{d} W_t + <span style="color: #d73a49;">\frac</span>{1}{2}<span style="color: #d73a49;">\;\nabla</span> <span style="color: #d73a49;">\log</span> <span style="color: #d73a49;">\pi</span>(L_t)<span style="color: #d73a49;">\;\mathrm</span>{d}t
<span style="color: #d73a49;">\end</span>{<span style="color: #6f42c1;">equation</span>}
</pre>
</div>


<p>
Where \(W_t\) is the standard Brownian motion. Equation (1) is a continuous time diffusion and we instead use a discrete approximation to this diffusion:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #d73a49;">\begin</span>{<span style="color: #6f42c1;">equation*</span>}
<span style="color: #d73a49;">\theta</span>_{t+1} = <span style="color: #d73a49;">\theta</span>_t + <span style="color: #d73a49;">\tau\;\nabla</span> <span style="color: #d73a49;">\log</span> <span style="color: #d73a49;">\pi</span>(<span style="color: #d73a49;">\theta</span>_t) + <span style="color: #d73a49;">\sqrt</span>{2<span style="color: #d73a49;">\,</span> <span style="color: #d73a49;">\tau\;</span> <span style="color: #d73a49;">\xi</span>
<span style="color: #d73a49;">\end</span>{<span style="color: #6f42c1;">equation*</span>}
</pre>
</div>

<p>
where
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #d73a49;">\begin</span>{<span style="color: #6f42c1;">equation*</span>}
<span style="color: #d73a49;">\xi</span> <span style="color: #d73a49;">\sim</span> <span style="color: #d73a49;">\operatorname</span>{Normal}(0,<span style="color: #d73a49;">\mathbb</span>{I}_k)
<span style="color: #d73a49;">\end</span>{<span style="color: #6f42c1;">equation*</span>}
</pre>
</div>

<p>
\(k\) is the number of dimension of \(\boldsymbol{\theta}\), \(\tau\) the step size and \(\pi\) the probability density. The idea, like with <a href="20220307090810-hamiltonian_monte_carlo.html#ID-dce96ffd-7673-4596-a6e7-2e7dd7299f76">Hamiltonian Monte Carlo</a>, is to use information about the gradient of the probability density funtion to produce a "better" proposal.
</p>

<p>
The dynamics defined by the discretized version of the Langevin dynamics only maintain the invariance of \(\pi\) approximately and so we need to perform an accept/reject step accepting \(\boldsymbol{\theta}_t\) with probability:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #d73a49;">\begin</span>{<span style="color: #6f42c1;">equation*</span>}
 <span style="color: #d73a49;">\alpha</span> = <span style="color: #d73a49;">\min</span> <span style="color: #d73a49;">\left\{</span>1, <span style="color: #d73a49;">\frac</span>{<span style="color: #d73a49;">\pi</span>(<span style="color: #d73a49;">\theta</span>_{t+1}) q(<span style="color: #d73a49;">\theta</span>_t | <span style="color: #d73a49;">\theta</span>_{t+1})}{<span style="color: #d73a49;">\pi</span>(<span style="color: #d73a49;">\theta</span>_{t}) q(<span style="color: #d73a49;">\theta</span>_{t+1} | <span style="color: #d73a49;">\theta</span>_{t})} <span style="color: #d73a49;">\right\}</span>
<span style="color: #d73a49;">\end</span>{<span style="color: #6f42c1;">equation*</span>}
</pre>
</div>


<p>
where
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #d73a49;">\begin</span>{<span style="color: #6f42c1;">equation*</span>}
  q<span style="color: #d73a49;">\left</span>(<span style="color: #d73a49;">\theta</span>_{t+1}|<span style="color: #d73a49;">\theta</span>_{t}<span style="color: #d73a49;">\right</span>) = <span style="color: #d73a49;">\exp\left</span>(-<span style="color: #d73a49;">\frac</span>{1}{4<span style="color: #d73a49;">\,</span> <span style="color: #d73a49;">\tau</span>} || <span style="color: #d73a49;">\theta</span>_{t+1} - <span style="color: #d73a49;">\theta</span>_t - <span style="color: #d73a49;">\tau\;\nabla\log</span> <span style="color: #d73a49;">\pi</span>(<span style="color: #d73a49;">\theta</span>_t) ||_2<span style="color: #d73a49;">\right</span>)
<span style="color: #d73a49;">\end</span>{<span style="color: #6f42c1;">equation*</span>}
</pre>
</div>

<p>
since
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #d73a49;">\begin</span>{<span style="color: #6f42c1;">equation*</span>}
  <span style="color: #d73a49;">\theta</span>_{{t+1}} <span style="color: #d73a49;">\sim</span> <span style="color: #d73a49;">\operatorname</span>{Normal}<span style="color: #d73a49;">\left</span>( <span style="color: #d73a49;">\theta</span>_{t} + <span style="color: #d73a49;">\frac</span>{<span style="color: #d73a49;">\tau</span>}{2}<span style="color: #d73a49;">\;\nabla\log</span> <span style="color: #d73a49;">\pi</span>(<span style="color: #d73a49;">\theta</span>_{t}) <span style="color: #d73a49;">\right</span>, <span style="color: #d73a49;">\tau\,\mathbb</span>{I}_k)
<span style="color: #d73a49;">\end</span>{<span style="color: #6f42c1;">equation*</span>}
</pre>
</div>

<div id="outline-container-org3648237" class="outline-2">
<h2 id="org3648237">References</h2>
<div class="outline-text-2" id="text-org3648237">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://en.wikipedia.org/wiki/Metropolis-adjusted_Langevin_algorithm">Wikipedia article</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://sci-hub.hkvisa.net/10.2307/3318418">Exponential Convergence of Langevin Distributions and Their Discrete Approximations</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0562e69" class="outline-2">
<h2 id="org0562e69">Links to this note</h2>
<div class="outline-text-2" id="text-org0562e69">
<ul class="org-ul">
<li><a href="./20220330091946-stochastic_gradient_langevin_dynamics_sgld.html">Stochastic gradient Langevin Dynamics (SgLD)</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>